---
kind: other
id: Methods.T:Autodesk.Revit.DB.TransformWithBoundary
source: html/d038054a-5f05-1ac7-58a4-9395297bf69b.htm
---
# TransformWithBoundary Methods

Returns the boundary for the model space to view projection space transform.